import Link from "next/link"

export default function Footer() {
  return (
    <>

    <div className="flex justify-center" style={{ fontFamily: 'Prompt' }}>
        <div className="flex justify-center bg-orange-50 rounded-2xl md:w-[1248px] md:h-[353px] min-[279px]:w-full min-[279px]:h-[744px] max-[1024px]:rounded-none">
            
        <div className=" md:h-[353px] flex items-end min-[375px]:items-center w-[375px] opacity-10 md:w-[500px]" >            
            <svg width={380} viewBox="0 0 231 216" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M121.147 67.9163V95.2671C107.754 84.1041 93.8946 78.5178 79.5693 78.5178C63.7886 78.5178 50.4906 84.1707 39.6752 95.467C28.8028 106.697 23.3619 120.439 23.3619 136.693C23.3619 152.948 28.8028 166.29 39.6752 177.329C50.5476 188.368 63.8837 193.879 79.6644 193.879C87.8258 193.879 94.7507 192.556 100.458 189.91C103.645 188.587 106.936 186.808 110.36 184.562C113.775 182.316 117.371 179.604 121.156 176.435V204.28C107.896 211.751 93.9707 215.481 79.379 215.481C57.4249 215.481 38.6955 207.849 23.1811 192.584C7.72387 177.186 0 158.629 0 136.883C0 117.393 6.46826 100.016 19.3953 84.7512C35.3091 66.051 55.903 56.7056 81.1673 56.7056C95.3821 56.7056 108.286 60.4362 121.156 67.9067L121.147 67.9163Z" fill="url(#paint0_linear_29_1803)"/>
            <path d="M121.165 141.626V0H150.96C165.243 0 176.532 1.40954 184.809 4.21986C193.695 6.96851 201.76 11.6465 208.995 18.2538C223.649 31.583 230.972 49.1056 230.972 70.8129C230.972 92.5201 223.34 110.193 208.067 123.645C200.4 130.376 192.37 135.054 183.97 137.679C176.117 140.313 164.996 141.626 150.589 141.626H121.156H121.165ZM142.595 121.54H152.25C161.878 121.54 169.881 120.526 176.258 118.509C182.636 116.368 188.395 112.976 193.545 108.325C204.092 98.7222 209.366 86.2212 209.366 70.8129C209.366 55.4046 204.154 42.6833 193.731 33.019C184.35 24.3942 170.526 20.0863 152.25 20.0863H142.595V121.531V121.54Z" fill="url(#paint1_linear_29_1803)"/>
            <defs>
            <linearGradient id="paint0_linear_29_1803" x1="60.5782" y1="56.7056" x2="60.5782" y2="215.481" gradientUnits="userSpaceOnUse">
            <stop stop-color="#171717"/>
            <stop offset="1" stop-color="#737373"/>
            </linearGradient>
            <linearGradient id="paint1_linear_29_1803" x1="176.064" y1="0" x2="121.355" y2="141.831" gradientUnits="userSpaceOnUse">
            <stop stop-color="#FF971A"/>
            <stop offset="1" stop-color="#FCD34D"/>
            </linearGradient>
            </defs>
            </svg>

        </div>

        <div className=" absolute py-8 md:space-x-16 max-[767.5px]:space-y-8 max-[768px]:px-4 md:flex md:py-16 md:px-8">
            <div className="w-80">
                <div className="pb-3.5">
                    <img src="/CreatederLogo.png" alt="Test" />
                </div>
                
                <div className="space-y-4">
                    <p className=" text-base text-neutral-600">บริษัท ครีเอทเดอร์ จำกัด</p>
                    <p className=" text-base text-neutral-600">พวกเราเชี่ยวชาญในอุตสาหกรรม
อสังหาริมทรัพย์</p>
                    <div className="flex space-x-3">
                    <div className="Fb">
                            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect x="0.5" y="0.5" width="31" height="31" rx="15.5" fill="white"/>
                                <g clipPath="url(#clip0_62_445)">
                                <path d="M20 9.33337C20.1633 9.3334 20.3209 9.39334 20.4429 9.50185C20.5649 9.61036 20.6429 9.75987 20.662 9.92204L20.6667 10V12.6667C20.6666 12.83 20.6067 12.9876 20.4982 13.1096C20.3897 13.2316 20.2402 13.3096 20.078 13.3287L20 13.3334H18V14H20C20.0949 14.0001 20.1887 14.0204 20.2751 14.0596C20.3616 14.0988 20.4386 14.156 20.5012 14.2274C20.5637 14.2987 20.6103 14.3826 20.6378 14.4735C20.6653 14.5643 20.6731 14.66 20.6607 14.754L20.6473 14.8287L19.9807 17.4954C19.9476 17.627 19.8751 17.7455 19.7729 17.8348C19.6706 17.9242 19.5436 17.9802 19.4087 17.9954L19.3333 18H18V22C18 22.1633 17.94 22.3209 17.8315 22.443C17.723 22.565 17.5735 22.6429 17.4113 22.662L17.3333 22.6667H14.6667C14.5034 22.6667 14.3458 22.6067 14.2238 22.4982C14.1017 22.3897 14.0238 22.2402 14.0047 22.078L14 22V18H12.6667C12.5034 18 12.3458 17.9401 12.2238 17.8316C12.1017 17.7231 12.0238 17.5735 12.0047 17.4114L12 17.3334V14.6667C12 14.5034 12.06 14.3458 12.1685 14.2238C12.277 14.1018 12.4265 14.0238 12.5887 14.0047L12.6667 14H14V13.3334C14 12.2985 14.401 11.3038 15.119 10.5584C15.8369 9.81299 16.8158 9.37485 17.85 9.33604L18 9.33337H20Z" fill="#64748B"/>
                                </g>
                                <rect x="0.5" y="0.5" width="31" height="31" rx="15.5" stroke="#F1F5F9"/>
                                <defs>
                                <clipPath id="clip0_62_445">
                                <rect width="16" height="16" fill="white" transform="translate(8 8)"/>
                                </clipPath>
                                </defs>
                            </svg>
                        </div>
                        
                        <div className="tt">
                            
                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect x="0.5" y="0.5" width="32" height="31" rx="15.5" fill="white"/>
                                <g clipPath="url(#clip0_62_447)">
                                <path d="M19.3922 9.33337H16.5C16.3122 9.33337 16.132 9.40361 15.9992 9.52864C15.8663 9.65366 15.7917 9.82323 15.7917 10V17.6667C15.7918 17.8328 15.7479 17.9963 15.664 18.1425C15.5802 18.2886 15.4589 18.4128 15.3113 18.5038C15.1636 18.5948 14.9942 18.6497 14.8184 18.6637C14.6425 18.6776 14.4657 18.6501 14.304 18.5836C14.1423 18.5172 14.0007 18.4138 13.892 18.2829C13.7833 18.1521 13.711 17.9978 13.6816 17.834C13.6521 17.6702 13.6665 17.5021 13.7234 17.3449C13.7803 17.1876 13.8779 17.0462 14.0074 16.9334L14.0924 16.8667C14.1802 16.8045 14.2515 16.724 14.3006 16.6314C14.3496 16.5389 14.3751 16.4368 14.375 16.3334V13.4494C14.3751 13.3487 14.351 13.2494 14.3045 13.1588C14.258 13.0682 14.1903 12.9887 14.1064 12.9262C14.0226 12.8637 13.9248 12.8199 13.8205 12.7981C13.7161 12.7762 13.6078 12.7769 13.5038 12.8C12.2352 13.0814 11.1208 13.7919 10.3726 14.7963C9.62436 15.8007 9.29453 17.0289 9.44585 18.2472C9.59717 19.4656 10.2191 20.5891 11.1932 21.404C12.1674 22.2189 13.4259 22.6683 14.7292 22.6667L14.9013 22.6634C16.2796 22.6213 17.5865 22.0765 18.5458 21.144C19.5051 20.2116 20.0415 18.9646 20.0417 17.6667V15.8667L20.262 15.9687C21.0567 16.322 21.9145 16.5474 22.8049 16.6307C22.9034 16.6399 23.0029 16.6296 23.0969 16.6004C23.1909 16.5713 23.2774 16.5239 23.3507 16.4613C23.424 16.3987 23.4826 16.3224 23.5227 16.2372C23.5628 16.152 23.5835 16.0599 23.5834 15.9667V13.278C23.5833 13.1204 23.524 12.9679 23.4158 12.8476C23.3077 12.7273 23.1578 12.6469 22.9926 12.6207C22.2678 12.505 21.5991 12.18 21.0791 11.6907C20.5592 11.2015 20.2137 10.5722 20.0906 9.89004C20.0629 9.7345 19.9776 9.59321 19.8497 9.49129C19.7218 9.38937 19.5597 9.33342 19.3922 9.33337Z" fill="#64748B"/>
                                </g>
                                <rect x="0.5" y="0.5" width="32" height="31" rx="15.5" stroke="#F1F5F9"/>
                                <defs>
                                <clipPath id="clip0_62_447">
                                <rect width="17" height="16" fill="white" transform="translate(8 8)"/>
                                </clipPath>
                                </defs>
                            </svg>

                        </div>

                        <div className="ig">
                            
                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect x="0.5" y="0.5" width="32" height="31" rx="15.5" fill="white"/>
                                <g clipPath="url(#clip0_62_449)">
                                <path d="M10.8333 13.3333C10.8333 12.626 11.1319 11.9478 11.6632 11.4477C12.1946 10.9476 12.9152 10.6666 13.6667 10.6666H19.3333C20.0848 10.6666 20.8055 10.9476 21.3368 11.4477C21.8682 11.9478 22.1667 12.626 22.1667 13.3333V18.6666C22.1667 19.3739 21.8682 20.0521 21.3368 20.5522C20.8055 21.0523 20.0848 21.3333 19.3333 21.3333H13.6667C12.9152 21.3333 12.1946 21.0523 11.6632 20.5522C11.1319 20.0521 10.8333 19.3739 10.8333 18.6666V13.3333Z" fill="#64748B" stroke="#64748B" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                                <path d="M14.375 16C14.375 16.5304 14.5989 17.0391 14.9974 17.4142C15.3959 17.7893 15.9364 18 16.5 18C17.0636 18 17.6041 17.7893 18.0026 17.4142C18.4011 17.0391 18.625 16.5304 18.625 16C18.625 15.4696 18.4011 14.9609 18.0026 14.5858C17.6041 14.2107 17.0636 14 16.5 14C15.9364 14 15.3959 14.2107 14.9974 14.5858C14.5989 14.9609 14.375 15.4696 14.375 16Z" fill="white"/>
                                <path d="M18.625 12.6667C18.625 12.8435 18.6996 13.013 18.8325 13.1381C18.9653 13.2631 19.1455 13.3333 19.3333 13.3333C19.5212 13.3333 19.7014 13.2631 19.8342 13.1381C19.967 13.013 20.0417 12.8435 20.0417 12.6667C20.0417 12.4899 19.967 12.3203 19.8342 12.1953C19.7014 12.0702 19.5212 12 19.3333 12C19.1455 12 18.9653 12.0702 18.8325 12.1953C18.6996 12.3203 18.625 12.4899 18.625 12.6667Z" fill="white"/>
                                </g>
                                <rect x="0.5" y="0.5" width="32" height="31" rx="15.5" stroke="#F1F5F9"/>
                                <defs>
                                <clipPath id="clip0_62_449">
                                <rect width="17" height="16" fill="white" transform="translate(8 8)"/>
                                </clipPath>
                                </defs>
                            </svg>

                        </div>
                        <div className="line">
                            
                            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect x="0.5" y="0.5" width="31" height="31" rx="15.5" fill="white"/>
                            <g clipPath="url(#clip0_62_451)">
                            <path d="M22 15.1087C22 12.2927 19.306 10 16 10C12.694 10 10 12.2927 10 15.1087C10 17.6307 12.134 19.7473 15.018 20.1487C15.72 20.308 15.6393 20.578 15.482 21.5707C15.456 21.7293 15.3593 22.192 16 21.912C16.64 21.632 19.4533 19.778 20.7153 18.2587C21.5847 17.256 22 16.2393 22 15.1153V15.1087Z" fill="#64748B" stroke="#64748B" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            </g>
                            <rect x="0.5" y="0.5" width="31" height="31" rx="15.5" stroke="#F1F5F9"/>
                            <defs>
                            <clipPath id="clip0_62_451">
                            <rect width="16" height="16" fill="white" transform="translate(8 8)"/>
                            </clipPath>
                            </defs>
                            </svg>

                        </div>

                       


                    </div>
                </div>
            </div>
            <div className="w-80">
                <div className="pb-7">
                    <h1 className="text-xl text-neutral-800 font-semibold">ทางลัด</h1>
                </div>
                <div className="flex flex-col space-y-3 text-neutral-600">
                    <Link className="hover:text-orange-400" href={""}>หน้าหลัก</Link>
                    <Link className="hover:text-orange-400" href={""}>บริการของเรา</Link>
                    <Link className="hover:text-orange-400" href={""}>ติดต่อเรา</Link>
                    <Link className="hover:text-orange-400" href={""}>บทความ</Link>
                    <Link className="hover:text-orange-400" href={""}>นโยบายความเป็นส่วนตัว</Link>
                </div>
            </div>
            <div className="lg:w-80 md:w-[200px]">
                <div className="pb-5">
                    <h1 className="text-xl text-neutral-800 font-semibold">รับข้อมูล และบทความใหม่</h1>
                </div>
                <div className="space-y-[26px]">
                    <p className=" text-base text-neutral-600">กรอกอีเมลของคุณ <br/> เพื่อรับข้อมูลดีๆ จากเรา</p>
                    
                    
                    <div className="flex flex-row bg-white w-[320px] min-[1200px]:w-[320px] md:w-[200px] h-[54px] border rounded-[7px]">
                        <input className="w-[280px] min-[1200px]:w-[280px] md:w-[143px] pl-4 border-neutral-200 block focus:outline-none rounded-[7px]" placeholder="อีเมล" style={{ fontFamily: 'Prompt' }} />
                        <div className="flex items-center px-4 ">
                            
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clipPath="url(#clip0_83_1238)">
                            <path d="M22 7.53497V17C22 17.7652 21.7077 18.5015 21.1827 19.0582C20.6578 19.615 19.9399 19.9501 19.176 19.995L19 20H5C4.23479 20 3.49849 19.7076 2.94174 19.1827C2.38499 18.6577 2.04989 17.9399 2.005 17.176L2 17V7.53497L11.445 13.832L11.561 13.898C11.6977 13.9648 11.8478 13.9995 12 13.9995C12.1522 13.9995 12.3023 13.9648 12.439 13.898L12.555 13.832L22 7.53497Z" fill="#FB923C"/>
                            <path d="M19 4C20.08 4 21.027 4.57 21.555 5.427L12 11.797L2.44501 5.427C2.69574 5.01977 3.04022 4.6784 3.44971 4.43138C3.85921 4.18436 4.32184 4.03886 4.79901 4.007L5.00001 4H19Z" fill="#FB923C"/>
                            </g>
                            <defs>
                            <clipPath id="clip0_83_1238">
                            <rect width="24" height="24" fill="white"/>
                            </clipPath>
                            </defs>
                            </svg>

                        </div>
                            
                       
                    </div>
                </div>

            </div>
            </div>
        </div>
    </div>
    <div className="text-center text-base md:pt-8 md:pb-12 py-4 p-2.5 text-neutral-400" style={{ fontFamily: 'Prompt' }}>
        <p>© 2023 บริษัท ครีเอทเดอร์ จำกัด. สงวนสิทธิ์ทุกประการ</p>
    </div>
    
    </>
  )
}